---
kind: type
id: T:Autodesk.Revit.UI.IDockablePaneProvider
source: html/cde36571-ccf1-f628-9e34-6a720388d348.htm
---
# Autodesk.Revit.UI.IDockablePaneProvider

Interface that the Revit UI will call during initialization of the user interface to gather information about add-in dockable pane windows.

## Syntax (C#)
```csharp
public interface IDockablePaneProvider
```